In [1]:
from google.colab import files
import pandas as pd
import seaborn as sns
import io
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import train_test_split
from scipy import stats
import numpy as np

In [2]:
df=pd.read_csv("archive.zip")

In [3]:
print(df)

      RowNumber  CustomerId    Surname  CreditScore Geography  Gender  Age  \
0             1    15634602   Hargrave          619    France  Female   42
1             2    15647311       Hill          608     Spain  Female   41
2             3    15619304       Onio          502    France  Female   42
3             4    15701354       Boni          699    France  Female   39
4             5    15737888   Mitchell          850     Spain  Female   43
...         ...         ...        ...          ...       ...     ...  ...
9995       9996    15606229   Obijiaku          771    France    Male   39
9996       9997    15569892  Johnstone          516    France    Male   35
9997       9998    15584532        Liu          709    France  Female   36
9998       9999    15682355  Sabbatini          772   Germany    Male   42
9999      10000    15628319     Walker          792    France  Female   28

      Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  \
0          2       0.00              1          1               1
1          1   83807.86              1          0               1
2          8  159660.80              3          1               0
3          1       0.00              2          0               0
4          2  125510.82              1          1               1
...      ...        ...            ...        ...             ...
9995       5       0.00              2          1               0
9996      10   57369.61              1          1               1
9997       7       0.00              1          0               1
9998       3   75075.31              2          1               0
9999       4  130142.79              1          1               0

      EstimatedSalary  Exited
0           101348.88       1
1           112542.58       0
2           113931.57       1
3            93826.63       0
4            79084.10       0
...               ...     ...
9995         96270.64       0
9996        101699.77       0
9997         42085.58       1
9998         92888.52       1
9999         38190.78       0

[10000 rows x 14 columns]

In [4]:
x=df.iloc[:,:-1].values
print(x)

[[1 15634602 'Hargrave' ... 1 1 101348.88]
 [2 15647311 'Hill' ... 0 1 112542.58]
 [3 15619304 'Onio' ... 1 0 113931.57]
 ...
 [9998 15584532 'Liu' ... 0 1 42085.58]
 [9999 15682355 'Sabbatini' ... 1 0 92888.52]
 [10000 15628319 'Walker' ... 1 0 38190.78]]

In [5]:
y=df.iloc[:,-1].values
print(y)

[1 0 1 ... 1 1 0]

In [6]:
print(df.isnull().sum())

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [7]:
numeric_df = df.select_dtypes(include=np.number)
df[numeric_df.columns] = df[numeric_df.columns].fillna(numeric_df.mean().round(1))
print(df.isnull().sum())

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [8]:
y = df.iloc[:, -1].values
print(y)

[1 0 1 ... 1 1 0]

In [9]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
9995    False
9996    False
9997    False
9998    False
9999    False
Length: 10000, dtype: bool

In [10]:
if 'Calories' in df.columns:
  print(df['Calories'].describe())
else:
  print("Column 'Calories' not found in the DataFrame.")

Column 'Calories' not found in the DataFrame.

In [16]:
X_train,X_test,y_train,y_test=train_test_split(x,y,test_size=0.2)
print(X_train)
print(len(X_train))
print(X_test)
print(len(X_test))

[[1751 15569410 'Tang' ... 1 1 153012.13]
 [2076 15741385 'Gallop' ... 1 1 188574.08]
 [3819 15740147 'Cremonesi' ... 0 1 93777.61]
 ...
 [1459 15678385 'Lange' ... 1 1 10472.31]
 [6352 15794472 'Brookes' ... 0 0 159800.16]
 [217 15680920 'Marchesi' ... 1 0 133007.34]]
8000
[[1082 15699911 'Chapman' ... 1 0 132295.95]
 [6543 15785831 'Sinclair' ... 1 1 56028.79]
 [9359 15729359 'Chambers' ... 1 1 41866.26]
 ...
 [2093 15757408 'Lo' ... 0 1 81054.0]
 [6665 15667632 'Birdseye' ... 0 1 72500.68]
 [2777 15685109 'Teng' ... 0 0 14917.09]]
2000